[WallPhasing X2AbilityTemplate]
LocFriendlyName="Wraith"
LocHelpText="This armor incorporates a dimensional shift to allow the wearer to pass freely through obstacles."
LocLongDescription="This armor allows the unit to pass directly through obstacles."
LocFlyOverText="Phased"

[HighCoverGenerator X2AbilityTemplate]
LocFriendlyName="Shieldwall"
LocHelpText="Generate an energy shield to provide <Ability:SHIELDWALL_HP/> ablative HP to yourself and high cover to squadmates wherever you stand. Moving or attacking will cancel the cover effect."
LocLongDescription="Generate an energy shield to provide <Ability:SHIELDWALL_HP/> ablative HP to yourself and high cover to squadmates wherever you stand. Moving or attacking will cancel the cover effect."

[HeavyPoweredArmor X2ArmorTemplate]
FriendlyName="W.A.R. Suit"
FriendlyNamePlural="W.A.R. Suits"
BriefSummary="This powered heavy battle armor grants massive damage Resistance and survivability, as well as a wrist-mounted heavy weapon hardpoint. The W.A.R. Suit can also generate temporary cover for allies with its powerful \"Shieldwall\" technology."
TacticalText="<Bullet/> The W.A.R. Suit allows a soldier to wrist mount a heavy weapon.\n<Bullet/> The W.A.R. Suit grants the \"Shieldwall\" ability, allowing the wearer to temporarily act as high cover for squadmates and boost their own defense in the process."